/*
	Программа является курсовой работой студента группы 7302 Кириллова Даниила
	Вариант 3
	Задание: Реализовать решение задачи об ограниченном рюкзаке.
	Пусть имеется набор предметов, каждый из которых имеет два параметра — вес и ценность.
	Также имеется рюкзак определенной вместимости.
	Задача заключается в том, чтобы собрать рюкзак с максимальной ценностью предметов внутри,
	соблюдая при этом ограничение рюкзака на суммарный вес и ограничения на число экземпляров каждого предмета.
*/

int main() {
	
}